name: "Sauron Net"
# note: 
layer {
  name: "data"
  type: "HDF5Data"
  top: "data"
  top: "label"
  hdf5_data_param {
    source: "./train.txt"
    batch_size: 128
  }
}
layer {
  name: "Slice1"
  type: "Slice"
  bottom: "data"
  top: "Slice1"
  top: "Slice2"
  top: "Slice3"
  top: "Slice4"
  top: "Slice5"
  top: "Slice6"
  top: "Slice7"
  top: "Slice8"
  top: "Slice9"
  top: "Slice10"
  top: "Slice11"
  top: "Slice12"
  top: "Slice13"
  top: "Slice14"
  top: "Slice15"
  top: "Slice16"
  top: "Slice17"
  top: "Slice18"
  top: "Slice19"
  top: "Slice20"
  top: "Slice21"
  top: "Slice22"
  top: "Slice23"
  top: "Slice24"
  top: "Slice25"
  top: "Slice26"
  top: "Slice27"
  top: "Slice28"
  top: "Slice29"
  top: "Slice30"
  top: "Slice31"
  top: "Slice32"
  top: "Slice33"
  top: "Slice34"
  top: "Slice35"
  top: "Slice36"
  top: "Slice37"
  top: "Slice38"
  top: "Slice39"
  top: "Slice40"
  top: "Slice41"
  top: "Slice42"
  top: "Slice43"
  top: "Slice44"
  top: "Slice45"
  top: "Slice46"
  top: "Slice47"
  top: "Slice48"
  top: "Slice49"
  top: "Slice50"
  top: "Slice51"
  top: "Slice52"
  top: "Slice53"
  top: "Slice54"
  top: "Slice55"
  top: "Slice56"
  top: "Slice57"
  top: "Slice58"
  top: "Slice59"
  top: "Slice60"
  top: "Slice61"
  top: "Slice62"
  top: "Slice63"
  top: "Slice64"
  top: "Slice65"
  top: "Slice66"
  top: "Slice67"
  top: "Slice68"
  top: "Slice69"
  top: "Slice70"
  top: "Slice71"
  top: "Slice72"
  top: "Slice73"
  top: "Slice74"
  top: "Slice75"
  top: "Slice76"
  top: "Slice77"
  top: "Slice78"
  top: "Slice79"
  top: "Slice80"
  top: "Slice81"
  top: "Slice82"
  top: "Slice83"
  top: "Slice84"
  top: "Slice85"
  top: "Slice86"
  top: "Slice87"
  top: "Slice88"
  top: "Slice89"
  top: "Slice90"
  top: "Slice91"
  top: "Slice92"
  top: "Slice93"
  top: "Slice94"
  top: "Slice95"
  top: "Slice96"
  top: "Slice97"
  top: "Slice98"
  top: "Slice99"
  top: "Slice100"
  slice_param {
    slice_point: 4
    slice_point: 8
    slice_point: 12
    slice_point: 16
    slice_point: 20
    slice_point: 24
    slice_point: 28
    slice_point: 32
    slice_point: 36
    slice_point: 40
    slice_point: 44
    slice_point: 48
    slice_point: 52
    slice_point: 56
    slice_point: 60
    slice_point: 64
    slice_point: 68
    slice_point: 72
    slice_point: 76
    slice_point: 80
    slice_point: 84
    slice_point: 88
    slice_point: 92
    slice_point: 96
    slice_point: 100
    slice_point: 104
    slice_point: 108
    slice_point: 112
    slice_point: 116
    slice_point: 120
    slice_point: 124
    slice_point: 128
    slice_point: 132
    slice_point: 136
    slice_point: 140
    slice_point: 144
    slice_point: 148
    slice_point: 152
    slice_point: 156
    slice_point: 160
    slice_point: 164
    slice_point: 168
    slice_point: 172
    slice_point: 176
    slice_point: 180
    slice_point: 184
    slice_point: 188
    slice_point: 192
    slice_point: 196
    slice_point: 200
    slice_point: 204
    slice_point: 208
    slice_point: 212
    slice_point: 216
    slice_point: 220
    slice_point: 224
    slice_point: 228
    slice_point: 232
    slice_point: 236
    slice_point: 240
    slice_point: 244
    slice_point: 248
    slice_point: 252
    slice_point: 256
    slice_point: 260
    slice_point: 264
    slice_point: 268
    slice_point: 272
    slice_point: 276
    slice_point: 280
    slice_point: 284
    slice_point: 288
    slice_point: 292
    slice_point: 296
    slice_point: 300
    slice_point: 304
    slice_point: 308
    slice_point: 312
    slice_point: 316
    slice_point: 320
    slice_point: 324
    slice_point: 328
    slice_point: 332
    slice_point: 336
    slice_point: 340
    slice_point: 344
    slice_point: 348
    slice_point: 352
    slice_point: 356
    slice_point: 360
    slice_point: 364
    slice_point: 368
    slice_point: 372
    slice_point: 376
    slice_point: 380
    slice_point: 384
    slice_point: 388
    slice_point: 392
    slice_point: 396
    axis: 3
  }
}
layer {
  name: "InnerProduct1"
  type: "InnerProduct"
  bottom: "Slice1"
  top: "InnerProduct1"
  param {
    name: "w_s"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "b_s"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 128
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "ReLU1"
  type: "ReLU"
  bottom: "InnerProduct1"
  top: "InnerProduct1"
}
layer {
  name: "InnerProduct2"
  type: "InnerProduct"
  bottom: "InnerProduct1"
  top: "InnerProduct2"
  param {
    name: "w_trans0"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "b_trans0"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 128
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "ReLU2"
  type: "ReLU"
  bottom: "InnerProduct2"
  top: "InnerProduct2"
}
layer {
  name: "InnerProduct3"
  type: "InnerProduct"
  bottom: "InnerProduct2"
  top: "InnerProduct3"
  param {
    name: "w_trans0"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "b_trans0"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 128
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "ReLU3"
  type: "ReLU"
  bottom: "InnerProduct3"
  top: "InnerProduct3"
}
layer {
  name: "InnerProduct4"
  type: "InnerProduct"
  bottom: "InnerProduct3"
  top: "InnerProduct4"
  param {
    name: "w_trans0"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "b_trans0"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 128
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "ReLU4"
  type: "ReLU"
  bottom: "InnerProduct4"
  top: "InnerProduct4"
}
layer {
  name: "InnerProduct5"
  type: "InnerProduct"
  bottom: "InnerProduct4"
  top: "InnerProduct5"
  param {
    name: "w_e"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "b_e"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "ReLU5"
  type: "ReLU"
  bottom: "InnerProduct5"
  top: "InnerProduct5"
}
layer {
  name: "InnerProduct6"
  type: "InnerProduct"
  bottom: "Slice2"
  top: "InnerProduct6"
  param {
    name: "w_s"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "b_s"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 128
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "ReLU6"
  type: "ReLU"
  bottom: "InnerProduct6"
  top: "InnerProduct6"
}
layer {
  name: "InnerProduct7"
  type: "InnerProduct"
  bottom: "InnerProduct6"
  top: "InnerProduct7"
  param {
    name: "w_trans0"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "b_trans0"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 128
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "ReLU7"
  type: "ReLU"
  bottom: "InnerProduct7"
  top: "InnerProduct7"
}
layer {
  name: "InnerProduct8"
  type: "InnerProduct"
  bottom: "InnerProduct7"
  top: "InnerProduct8"
  param {
    name: "w_trans0"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "b_trans0"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 128
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "ReLU8"
  type: "ReLU"
  bottom: "InnerProduct8"
  top: "InnerProduct8"
}
layer {
  name: "InnerProduct9"
  type: "InnerProduct"
  bottom: "InnerProduct8"
  top: "InnerProduct9"
  param {
    name: "w_trans0"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "b_trans0"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 128
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "ReLU9"
  type: "ReLU"
  bottom: "InnerProduct9"
  top: "InnerProduct9"
}
layer {
  name: "InnerProduct10"
  type: "InnerProduct"
  bottom: "InnerProduct9"
  top: "InnerProduct10"
  param {
    name: "w_e"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "b_e"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "ReLU10"
  type: "ReLU"
  bottom: "InnerProduct10"
  top: "InnerProduct10"
}
layer {
  name: "InnerProduct11"
  type: "InnerProduct"
  bottom: "Slice3"
  top: "InnerProduct11"
  param {
    name: "w_s"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "b_s"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 128
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "ReLU11"
  type: "ReLU"
  bottom: "InnerProduct11"
  top: "InnerProduct11"
}
layer {
  name: "InnerProduct12"
  type: "InnerProduct"
  bottom: "InnerProduct11"
  top: "InnerProduct12"
  param {
    name: "w_trans0"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "b_trans0"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 128
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "ReLU12"
  type: "ReLU"
  bottom: "InnerProduct12"
  top: "InnerProduct12"
}
layer {
  name: "InnerProduct13"
  type: "InnerProduct"
  bottom: "InnerProduct12"
  top: "InnerProduct13"
  param {
    name: "w_trans0"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "b_trans0"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 128
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "ReLU13"
  type: "ReLU"
  bottom: "InnerProduct13"
  top: "InnerProduct13"
}
layer {
  name: "InnerProduct14"
  type: "InnerProduct"
  bottom: "InnerProduct13"
  top: "InnerProduct14"
  param {
    name: "w_trans0"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "b_trans0"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 128
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "ReLU14"
  type: "ReLU"
  bottom: "InnerProduct14"
  top: "InnerProduct14"
}
layer {
  name: "InnerProduct15"
  type: "InnerProduct"
  bottom: "InnerProduct14"
  top: "InnerProduct15"
  param {
    name: "w_e"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "b_e"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "ReLU15"
  type: "ReLU"
  bottom: "InnerProduct15"
  top: "InnerProduct15"
}
layer {
  name: "InnerProduct16"
  type: "InnerProduct"
  bottom: "Slice4"
  top: "InnerProduct16"
  param {
    name: "w_s"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "b_s"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 128
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "ReLU16"
  type: "ReLU"
  bottom: "InnerProduct16"
  top: "InnerProduct16"
}
layer {
  name: "InnerProduct17"
  type: "InnerProduct"
  bottom: "InnerProduct16"
  top: "InnerProduct17"
  param {
    name: "w_trans0"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "b_trans0"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 128
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "ReLU17"
  type: "ReLU"
  bottom: "InnerProduct17"
  top: "InnerProduct17"
}
layer {
  name: "InnerProduct18"
  type: "InnerProduct"
  bottom: "InnerProduct17"
  top: "InnerProduct18"
  param {
    name: "w_trans0"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "b_trans0"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 128
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "ReLU18"
  type: "ReLU"
  bottom: "InnerProduct18"
  top: "InnerProduct18"
}
layer {
  name: "InnerProduct19"
  type: "InnerProduct"
  bottom: "InnerProduct18"
  top: "InnerProduct19"
  param {
    name: "w_trans0"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "b_trans0"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 128
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "ReLU19"
  type: "ReLU"
  bottom: "InnerProduct19"
  top: "InnerProduct19"
}
layer {
  name: "InnerProduct20"
  type: "InnerProduct"
  bottom: "InnerProduct19"
  top: "InnerProduct20"
  param {
    name: "w_e"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "b_e"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "ReLU20"
  type: "ReLU"
  bottom: "InnerProduct20"
  top: "InnerProduct20"
}
layer {
  name: "InnerProduct21"
  type: "InnerProduct"
  bottom: "Slice5"
  top: "InnerProduct21"
  param {
    name: "w_s"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "b_s"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 128
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "ReLU21"
  type: "ReLU"
  bottom: "InnerProduct21"
  top: "InnerProduct21"
}
layer {
  name: "InnerProduct22"
  type: "InnerProduct"
  bottom: "InnerProduct21"
  top: "InnerProduct22"
  param {
    name: "w_trans0"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "b_trans0"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 128
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "ReLU22"
  type: "ReLU"
  bottom: "InnerProduct22"
  top: "InnerProduct22"
}
layer {
  name: "InnerProduct23"
  type: "InnerProduct"
  bottom: "InnerProduct22"
  top: "InnerProduct23"
  param {
    name: "w_trans0"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "b_trans0"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 128
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "ReLU23"
  type: "ReLU"
  bottom: "InnerProduct23"
  top: "InnerProduct23"
}
layer {
  name: "InnerProduct24"
  type: "InnerProduct"
  bottom: "InnerProduct23"
  top: "InnerProduct24"
  param {
    name: "w_trans0"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "b_trans0"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 128
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "ReLU24"
  type: "ReLU"
  bottom: "InnerProduct24"
  top: "InnerProduct24"
}
layer {
  name: "InnerProduct25"
  type: "InnerProduct"
  bottom: "InnerProduct24"
  top: "InnerProduct25"
  param {
    name: "w_e"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "b_e"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "ReLU25"
  type: "ReLU"
  bottom: "InnerProduct25"
  top: "InnerProduct25"
}
layer {
  name: "InnerProduct26"
  type: "InnerProduct"
  bottom: "Slice6"
  top: "InnerProduct26"
  param {
    name: "w_s"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "b_s"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 128
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "ReLU26"
  type: "ReLU"
  bottom: "InnerProduct26"
  top: "InnerProduct26"
}
layer {
  name: "InnerProduct27"
  type: "InnerProduct"
  bottom: "InnerProduct26"
  top: "InnerProduct27"
  param {
    name: "w_trans0"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "b_trans0"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 128
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "ReLU27"
  type: "ReLU"
  bottom: "InnerProduct27"
  top: "InnerProduct27"
}
layer {
  name: "InnerProduct28"
  type: "InnerProduct"
  bottom: "InnerProduct27"
  top: "InnerProduct28"
  param {
    name: "w_trans0"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "b_trans0"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 128
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "ReLU28"
  type: "ReLU"
  bottom: "InnerProduct28"
  top: "InnerProduct28"
}
layer {
  name: "InnerProduct29"
  type: "InnerProduct"
  bottom: "InnerProduct28"
  top: "InnerProduct29"
  param {
    name: "w_trans0"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "b_trans0"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 128
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "ReLU29"
  type: "ReLU"
  bottom: "InnerProduct29"
  top: "InnerProduct29"
}
layer {
  name: "InnerProduct30"
  type: "InnerProduct"
  bottom: "InnerProduct29"
  top: "InnerProduct30"
  param {
    name: "w_e"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "b_e"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "ReLU30"
  type: "ReLU"
  bottom: "InnerProduct30"
  top: "InnerProduct30"
}
layer {
  name: "InnerProduct31"
  type: "InnerProduct"
  bottom: "Slice7"
  top: "InnerProduct31"
  param {
    name: "w_s"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "b_s"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 128
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "ReLU31"
  type: "ReLU"
  bottom: "InnerProduct31"
  top: "InnerProduct31"
}
layer {
  name: "InnerProduct32"
  type: "InnerProduct"
  bottom: "InnerProduct31"
  top: "InnerProduct32"
  param {
    name: "w_trans0"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "b_trans0"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 128
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "ReLU32"
  type: "ReLU"
  bottom: "InnerProduct32"
  top: "InnerProduct32"
}
layer {
  name: "InnerProduct33"
  type: "InnerProduct"
  bottom: "InnerProduct32"
  top: "InnerProduct33"
  param {
    name: "w_trans0"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "b_trans0"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 128
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "ReLU33"
  type: "ReLU"
  bottom: "InnerProduct33"
  top: "InnerProduct33"
}
layer {
  name: "InnerProduct34"
  type: "InnerProduct"
  bottom: "InnerProduct33"
  top: "InnerProduct34"
  param {
    name: "w_trans0"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "b_trans0"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 128
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "ReLU34"
  type: "ReLU"
  bottom: "InnerProduct34"
  top: "InnerProduct34"
}
layer {
  name: "InnerProduct35"
  type: "InnerProduct"
  bottom: "InnerProduct34"
  top: "InnerProduct35"
  param {
    name: "w_e"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "b_e"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "ReLU35"
  type: "ReLU"
  bottom: "InnerProduct35"
  top: "InnerProduct35"
}
layer {
  name: "InnerProduct36"
  type: "InnerProduct"
  bottom: "Slice8"
  top: "InnerProduct36"
  param {
    name: "w_s"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "b_s"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 128
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "ReLU36"
  type: "ReLU"
  bottom: "InnerProduct36"
  top: "InnerProduct36"
}
layer {
  name: "InnerProduct37"
  type: "InnerProduct"
  bottom: "InnerProduct36"
  top: "InnerProduct37"
  param {
    name: "w_trans0"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "b_trans0"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 128
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "ReLU37"
  type: "ReLU"
  bottom: "InnerProduct37"
  top: "InnerProduct37"
}
layer {
  name: "InnerProduct38"
  type: "InnerProduct"
  bottom: "InnerProduct37"
  top: "InnerProduct38"
  param {
    name: "w_trans0"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "b_trans0"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 128
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "ReLU38"
  type: "ReLU"
  bottom: "InnerProduct38"
  top: "InnerProduct38"
}
layer {
  name: "InnerProduct39"
  type: "InnerProduct"
  bottom: "InnerProduct38"
  top: "InnerProduct39"
  param {
    name: "w_trans0"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "b_trans0"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 128
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "ReLU39"
  type: "ReLU"
  bottom: "InnerProduct39"
  top: "InnerProduct39"
}
layer {
  name: "InnerProduct40"
  type: "InnerProduct"
  bottom: "InnerProduct39"
  top: "InnerProduct40"
  param {
    name: "w_e"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "b_e"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "ReLU40"
  type: "ReLU"
  bottom: "InnerProduct40"
  top: "InnerProduct40"
}
layer {
  name: "InnerProduct41"
  type: "InnerProduct"
  bottom: "Slice9"
  top: "InnerProduct41"
  param {
    name: "w_s"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "b_s"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 128
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "ReLU41"
  type: "ReLU"
  bottom: "InnerProduct41"
  top: "InnerProduct41"
}
layer {
  name: "InnerProduct42"
  type: "InnerProduct"
  bottom: "InnerProduct41"
  top: "InnerProduct42"
  param {
    name: "w_trans0"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "b_trans0"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 128
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "ReLU42"
  type: "ReLU"
  bottom: "InnerProduct42"
  top: "InnerProduct42"
}
layer {
  name: "InnerProduct43"
  type: "InnerProduct"
  bottom: "InnerProduct42"
  top: "InnerProduct43"
  param {
    name: "w_trans0"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "b_trans0"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 128
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "ReLU43"
  type: "ReLU"
  bottom: "InnerProduct43"
  top: "InnerProduct43"
}
layer {
  name: "InnerProduct44"
  type: "InnerProduct"
  bottom: "InnerProduct43"
  top: "InnerProduct44"
  param {
    name: "w_trans0"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "b_trans0"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 128
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "ReLU44"
  type: "ReLU"
  bottom: "InnerProduct44"
  top: "InnerProduct44"
}
layer {
  name: "InnerProduct45"
  type: "InnerProduct"
  bottom: "InnerProduct44"
  top: "InnerProduct45"
  param {
    name: "w_e"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "b_e"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "ReLU45"
  type: "ReLU"
  bottom: "InnerProduct45"
  top: "InnerProduct45"
}
layer {
  name: "InnerProduct46"
  type: "InnerProduct"
  bottom: "Slice10"
  top: "InnerProduct46"
  param {
    name: "w_s"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "b_s"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 128
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "ReLU46"
  type: "ReLU"
  bottom: "InnerProduct46"
  top: "InnerProduct46"
}
layer {
  name: "InnerProduct47"
  type: "InnerProduct"
  bottom: "InnerProduct46"
  top: "InnerProduct47"
  param {
    name: "w_trans0"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "b_trans0"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 128
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "ReLU47"
  type: "ReLU"
  bottom: "InnerProduct47"
  top: "InnerProduct47"
}
layer {
  name: "InnerProduct48"
  type: "InnerProduct"
  bottom: "InnerProduct47"
  top: "InnerProduct48"
  param {
    name: "w_trans0"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "b_trans0"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 128
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "ReLU48"
  type: "ReLU"
  bottom: "InnerProduct48"
  top: "InnerProduct48"
}
layer {
  name: "InnerProduct49"
  type: "InnerProduct"
  bottom: "InnerProduct48"
  top: "InnerProduct49"
  param {
    name: "w_trans0"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "b_trans0"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 128
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "ReLU49"
  type: "ReLU"
  bottom: "InnerProduct49"
  top: "InnerProduct49"
}
layer {
  name: "InnerProduct50"
  type: "InnerProduct"
  bottom: "InnerProduct49"
  top: "InnerProduct50"
  param {
    name: "w_e"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "b_e"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "ReLU50"
  type: "ReLU"
  bottom: "InnerProduct50"
  top: "InnerProduct50"
}
layer {
  name: "InnerProduct51"
  type: "InnerProduct"
  bottom: "Slice11"
  top: "InnerProduct51"
  param {
    name: "w_s"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "b_s"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 128
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "ReLU51"
  type: "ReLU"
  bottom: "InnerProduct51"
  top: "InnerProduct51"
}
layer {
  name: "InnerProduct52"
  type: "InnerProduct"
  bottom: "InnerProduct51"
  top: "InnerProduct52"
  param {
    name: "w_trans0"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "b_trans0"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 128
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "ReLU52"
  type: "ReLU"
  bottom: "InnerProduct52"
  top: "InnerProduct52"
}
layer {
  name: "InnerProduct53"
  type: "InnerProduct"
  bottom: "InnerProduct52"
  top: "InnerProduct53"
  param {
    name: "w_trans0"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "b_trans0"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 128
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "ReLU53"
  type: "ReLU"
  bottom: "InnerProduct53"
  top: "InnerProduct53"
}
layer {
  name: "InnerProduct54"
  type: "InnerProduct"
  bottom: "InnerProduct53"
  top: "InnerProduct54"
  param {
    name: "w_trans0"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "b_trans0"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 128
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "ReLU54"
  type: "ReLU"
  bottom: "InnerProduct54"
  top: "InnerProduct54"
}
layer {
  name: "InnerProduct55"
  type: "InnerProduct"
  bottom: "InnerProduct54"
  top: "InnerProduct55"
  param {
    name: "w_e"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "b_e"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "ReLU55"
  type: "ReLU"
  bottom: "InnerProduct55"
  top: "InnerProduct55"
}
layer {
  name: "InnerProduct56"
  type: "InnerProduct"
  bottom: "Slice12"
  top: "InnerProduct56"
  param {
    name: "w_s"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "b_s"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 128
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "ReLU56"
  type: "ReLU"
  bottom: "InnerProduct56"
  top: "InnerProduct56"
}
layer {
  name: "InnerProduct57"
  type: "InnerProduct"
  bottom: "InnerProduct56"
  top: "InnerProduct57"
  param {
    name: "w_trans0"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "b_trans0"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 128
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "ReLU57"
  type: "ReLU"
  bottom: "InnerProduct57"
  top: "InnerProduct57"
}
layer {
  name: "InnerProduct58"
  type: "InnerProduct"
  bottom: "InnerProduct57"
  top: "InnerProduct58"
  param {
    name: "w_trans0"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "b_trans0"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 128
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "ReLU58"
  type: "ReLU"
  bottom: "InnerProduct58"
  top: "InnerProduct58"
}
layer {
  name: "InnerProduct59"
  type: "InnerProduct"
  bottom: "InnerProduct58"
  top: "InnerProduct59"
  param {
    name: "w_trans0"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "b_trans0"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 128
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "ReLU59"
  type: "ReLU"
  bottom: "InnerProduct59"
  top: "InnerProduct59"
}
layer {
  name: "InnerProduct60"
  type: "InnerProduct"
  bottom: "InnerProduct59"
  top: "InnerProduct60"
  param {
    name: "w_e"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "b_e"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "ReLU60"
  type: "ReLU"
  bottom: "InnerProduct60"
  top: "InnerProduct60"
}
layer {
  name: "InnerProduct61"
  type: "InnerProduct"
  bottom: "Slice13"
  top: "InnerProduct61"
  param {
    name: "w_s"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "b_s"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 128
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "ReLU61"
  type: "ReLU"
  bottom: "InnerProduct61"
  top: "InnerProduct61"
}
layer {
  name: "InnerProduct62"
  type: "InnerProduct"
  bottom: "InnerProduct61"
  top: "InnerProduct62"
  param {
    name: "w_trans0"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "b_trans0"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 128
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "ReLU62"
  type: "ReLU"
  bottom: "InnerProduct62"
  top: "InnerProduct62"
}
layer {
  name: "InnerProduct63"
  type: "InnerProduct"
  bottom: "InnerProduct62"
  top: "InnerProduct63"
  param {
    name: "w_trans0"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "b_trans0"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 128
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "ReLU63"
  type: "ReLU"
  bottom: "InnerProduct63"
  top: "InnerProduct63"
}
layer {
  name: "InnerProduct64"
  type: "InnerProduct"
  bottom: "InnerProduct63"
  top: "InnerProduct64"
  param {
    name: "w_trans0"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "b_trans0"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 128
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "ReLU64"
  type: "ReLU"
  bottom: "InnerProduct64"
  top: "InnerProduct64"
}
layer {
  name: "InnerProduct65"
  type: "InnerProduct"
  bottom: "InnerProduct64"
  top: "InnerProduct65"
  param {
    name: "w_e"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "b_e"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "ReLU65"
  type: "ReLU"
  bottom: "InnerProduct65"
  top: "InnerProduct65"
}
layer {
  name: "InnerProduct66"
  type: "InnerProduct"
  bottom: "Slice14"
  top: "InnerProduct66"
  param {
    name: "w_s"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "b_s"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 128
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "ReLU66"
  type: "ReLU"
  bottom: "InnerProduct66"
  top: "InnerProduct66"
}
layer {
  name: "InnerProduct67"
  type: "InnerProduct"
  bottom: "InnerProduct66"
  top: "InnerProduct67"
  param {
    name: "w_trans0"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "b_trans0"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 128
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "ReLU67"
  type: "ReLU"
  bottom: "InnerProduct67"
  top: "InnerProduct67"
}
layer {
  name: "InnerProduct68"
  type: "InnerProduct"
  bottom: "InnerProduct67"
  top: "InnerProduct68"
  param {
    name: "w_trans0"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "b_trans0"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 128
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "ReLU68"
  type: "ReLU"
  bottom: "InnerProduct68"
  top: "InnerProduct68"
}
layer {
  name: "InnerProduct69"
  type: "InnerProduct"
  bottom: "InnerProduct68"
  top: "InnerProduct69"
  param {
    name: "w_trans0"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "b_trans0"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 128
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "ReLU69"
  type: "ReLU"
  bottom: "InnerProduct69"
  top: "InnerProduct69"
}
layer {
  name: "InnerProduct70"
  type: "InnerProduct"
  bottom: "InnerProduct69"
  top: "InnerProduct70"
  param {
    name: "w_e"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "b_e"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "ReLU70"
  type: "ReLU"
  bottom: "InnerProduct70"
  top: "InnerProduct70"
}
layer {
  name: "InnerProduct71"
  type: "InnerProduct"
  bottom: "Slice15"
  top: "InnerProduct71"
  param {
    name: "w_s"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "b_s"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 128
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "ReLU71"
  type: "ReLU"
  bottom: "InnerProduct71"
  top: "InnerProduct71"
}
layer {
  name: "InnerProduct72"
  type: "InnerProduct"
  bottom: "InnerProduct71"
  top: "InnerProduct72"
  param {
    name: "w_trans0"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "b_trans0"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 128
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "ReLU72"
  type: "ReLU"
  bottom: "InnerProduct72"
  top: "InnerProduct72"
}
layer {
  name: "InnerProduct73"
  type: "InnerProduct"
  bottom: "InnerProduct72"
  top: "InnerProduct73"
  param {
    name: "w_trans0"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "b_trans0"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 128
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "ReLU73"
  type: "ReLU"
  bottom: "InnerProduct73"
  top: "InnerProduct73"
}
layer {
  name: "InnerProduct74"
  type: "InnerProduct"
  bottom: "InnerProduct73"
  top: "InnerProduct74"
  param {
    name: "w_trans0"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "b_trans0"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 128
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "ReLU74"
  type: "ReLU"
  bottom: "InnerProduct74"
  top: "InnerProduct74"
}
layer {
  name: "InnerProduct75"
  type: "InnerProduct"
  bottom: "InnerProduct74"
  top: "InnerProduct75"
  param {
    name: "w_e"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "b_e"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "ReLU75"
  type: "ReLU"
  bottom: "InnerProduct75"
  top: "InnerProduct75"
}
layer {
  name: "InnerProduct76"
  type: "InnerProduct"
  bottom: "Slice16"
  top: "InnerProduct76"
  param {
    name: "w_s"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "b_s"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 128
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "ReLU76"
  type: "ReLU"
  bottom: "InnerProduct76"
  top: "InnerProduct76"
}
layer {
  name: "InnerProduct77"
  type: "InnerProduct"
  bottom: "InnerProduct76"
  top: "InnerProduct77"
  param {
    name: "w_trans0"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "b_trans0"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 128
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "ReLU77"
  type: "ReLU"
  bottom: "InnerProduct77"
  top: "InnerProduct77"
}
layer {
  name: "InnerProduct78"
  type: "InnerProduct"
  bottom: "InnerProduct77"
  top: "InnerProduct78"
  param {
    name: "w_trans0"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "b_trans0"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 128
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "ReLU78"
  type: "ReLU"
  bottom: "InnerProduct78"
  top: "InnerProduct78"
}
layer {
  name: "InnerProduct79"
  type: "InnerProduct"
  bottom: "InnerProduct78"
  top: "InnerProduct79"
  param {
    name: "w_trans0"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "b_trans0"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 128
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "ReLU79"
  type: "ReLU"
  bottom: "InnerProduct79"
  top: "InnerProduct79"
}
layer {
  name: "InnerProduct80"
  type: "InnerProduct"
  bottom: "InnerProduct79"
  top: "InnerProduct80"
  param {
    name: "w_e"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "b_e"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "ReLU80"
  type: "ReLU"
  bottom: "InnerProduct80"
  top: "InnerProduct80"
}
layer {
  name: "InnerProduct81"
  type: "InnerProduct"
  bottom: "Slice17"
  top: "InnerProduct81"
  param {
    name: "w_s"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "b_s"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 128
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "ReLU81"
  type: "ReLU"
  bottom: "InnerProduct81"
  top: "InnerProduct81"
}
layer {
  name: "InnerProduct82"
  type: "InnerProduct"
  bottom: "InnerProduct81"
  top: "InnerProduct82"
  param {
    name: "w_trans0"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "b_trans0"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 128
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "ReLU82"
  type: "ReLU"
  bottom: "InnerProduct82"
  top: "InnerProduct82"
}
layer {
  name: "InnerProduct83"
  type: "InnerProduct"
  bottom: "InnerProduct82"
  top: "InnerProduct83"
  param {
    name: "w_trans0"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "b_trans0"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 128
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "ReLU83"
  type: "ReLU"
  bottom: "InnerProduct83"
  top: "InnerProduct83"
}
layer {
  name: "InnerProduct84"
  type: "InnerProduct"
  bottom: "InnerProduct83"
  top: "InnerProduct84"
  param {
    name: "w_trans0"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "b_trans0"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 128
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "ReLU84"
  type: "ReLU"
  bottom: "InnerProduct84"
  top: "InnerProduct84"
}
layer {
  name: "InnerProduct85"
  type: "InnerProduct"
  bottom: "InnerProduct84"
  top: "InnerProduct85"
  param {
    name: "w_e"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "b_e"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "ReLU85"
  type: "ReLU"
  bottom: "InnerProduct85"
  top: "InnerProduct85"
}
layer {
  name: "InnerProduct86"
  type: "InnerProduct"
  bottom: "Slice18"
  top: "InnerProduct86"
  param {
    name: "w_s"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "b_s"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 128
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "ReLU86"
  type: "ReLU"
  bottom: "InnerProduct86"
  top: "InnerProduct86"
}
layer {
  name: "InnerProduct87"
  type: "InnerProduct"
  bottom: "InnerProduct86"
  top: "InnerProduct87"
  param {
    name: "w_trans0"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "b_trans0"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 128
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "ReLU87"
  type: "ReLU"
  bottom: "InnerProduct87"
  top: "InnerProduct87"
}
layer {
  name: "InnerProduct88"
  type: "InnerProduct"
  bottom: "InnerProduct87"
  top: "InnerProduct88"
  param {
    name: "w_trans0"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "b_trans0"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 128
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "ReLU88"
  type: "ReLU"
  bottom: "InnerProduct88"
  top: "InnerProduct88"
}
layer {
  name: "InnerProduct89"
  type: "InnerProduct"
  bottom: "InnerProduct88"
  top: "InnerProduct89"
  param {
    name: "w_trans0"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "b_trans0"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 128
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "ReLU89"
  type: "ReLU"
  bottom: "InnerProduct89"
  top: "InnerProduct89"
}
layer {
  name: "InnerProduct90"
  type: "InnerProduct"
  bottom: "InnerProduct89"
  top: "InnerProduct90"
  param {
    name: "w_e"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "b_e"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "ReLU90"
  type: "ReLU"
